import 'dart:core';


import '../model/tourist_attraction.dart';

class Place {
  Place();
  List Beijing = [
    Tourist_attraction(
      name: 'จัตุรัสเทียนอันเหมิน',
      imageURL: 'assets/images/Baijing/bj1.jpg',
      detail:
      'จัตุรัสเทียนอันเหมินมีความสำคัญในวัฒนธรรมที่ยิ่งใหญ่ และเป็นสัญลักษณ์ที่สำคัญของประเทศจีน'
          ' เพราะว่าจัตุรัสเทียนอันเหมิน คือที่ตั้งของเหตุการณ์สำคัญมามากมายในประวัติศาสตร์จีนจัตุรัสเทียนอันเหมินเป็นจัตุรัสที่มีขนาดใหญ่ที่สุดในโลก'
          ' มีความยาวตั้งแต่ทิศเหนือจรดทิศใต้ 880 เมตร ทิศตะวันออกจรดทิศตะวันตก 500 เมตร พื้นที่ทั้งสิ้น 440,000 ตารางเมตร'
          ' สามารถจุประชากรได้ถึง 1,000,000 คน ปัจจุบันจัตุรัสเทียนอันเหมินนับเป็นจัตุรัสใจกลางเมืองที่ใหญ่ที่สุดในโลก'
          'จัตุรัสเทียนอันเหมิน สร้างเมื่อปีค.ศ. 1417 ในสมัยราชวงศ์หมิงมีชื่อเดิมว่า "เฉิงเทียนเหมิน" ต่อมาในรัชสมัยของ '
          'สมเด็จพระจักรพรรดิซุ่นจื้อแห่งราชวงศ์ชิง ทรงโปรดฯให้มีการบูรณะขึ้นใหม่ในปี ค.ศ. 1651 และยังทรงโปรดฯให้เปลี่ยนชื่อเป็น '
          '"เทียนอันเหมิน"[1] คำว่า ‘เทียน’ แปลว่า ฟ้า ‘อัน’ แปลว่า ผาสุก สันติ ราบคาบ ‘เหมิน’ แปลว่า ประตู '
          'จัตุรัสเทียนอันเหมินล้อมรอบด้วยสถาปัตยกรรมที่มีความสำคัญ ได้แก่ หอประตูเทียนอันเหมินที่ตั้งอยู่ทางทิศเหนือสุดของจัตุรัส'
          ' ธงแดงดาว 5 ดวงผืนใหญ่โบกสะบัดอยู่เหนือเสาธงกลางจัตุรัส อนุสาวรีย์วีรชนใจกลางจัตุรัส มหาศาลาแห่งประชาชนด้านทิศตะวันตกของจัตุรัส'
          ' ตลอดจนพิพิธภัณฑ์การปฏิวัติแห่งชาติและพิพิธภัณฑ์ประวัติศาสตร์ชาติจีนทางฝั่งตะวันออก นอกจากนี้ทางด้านทิศใต้ยังมีหอรำลึกประธานเหมา'
          ' และหอประตูเจิ้งหยางเหมิน (จีน: 正阳门城楼) หรือเฉียนเหมิน',
      description:
      'สัมผัสกับจัตุรัสที่ใหญ่ที่สุดในโลก โดยสามารถจุประชากรได้ถึงหนึ่งล้านคน จัตุรัสแห่งนี้ เป็นสัญลักษณ์ที่สำคัญของประเทศจีน'
          ' มีความสำคัญทางด้านวัฒนธรรมและประวัติศาสตร์ประเทศจีนที่ยิ่งใหญ่ เป็นสถานที่จัดพิธีฉลองเนื่องในโอกาสสำคัญต่างๆ',
      location: 'Dongcheng, Beijing',
    ),
    Tourist_attraction(
      name: 'พระราชวังต้องห้าม',
      imageURL: 'assets/images/Baijing/bj2.jpg',
      detail:
      'พระราชวังต้องห้าม หรือ พระราชวังกู้กง จากชื่อภาษาจีนแปลตามตัวอักษรได้ว่า "เมืองต้องห้ามสีม่วง" พระราชวังต้องห้ามตั้งอยู่ใจกลางของกรุงปักกิ่ง'
          ' เมืองหลวงของประเทศจีน เป็นพระราชวังหลวงมาตั้งแต่สมัยกลางราชวงศ์หมิงจนถึงราชวงศ์ชิง พระราชวังต้องห้ามยังเป็นที่รู้จักกันในนามของ'
          ' พิพิธภัณฑ์พระราชวัง (ภาษาจีน: 故宫博物院; พินอิน: Gùgōng Bówùyùan) ซึ่งครอบคลุมพื้นที่ 720,000 ตารางเมตร อาคาร 980 หลัง'
          ' พระราชวังต้องห้ามมีห้องทั้งหมด 9,999 ห้อง[3] และมีพระที่นั่ง 75 องค์ หอพระสมุด และห้องลับต่าง ๆ อีกมาก ทั้งยังมีสวน ลานกว้าง'
          ' และทางเดินเชื่อมกันโดยตลอด มีคูและกำแพงที่สูงถึง 11 เมตร[4] ล้อมรอบ พระราชวังต้องห้ามใช้ระยะก่อสร้างประมาณ 14 ปี ตั้งแต่ ค.ศ. 1406 จนถึง ค.ศ. 1420'
          ' พระราชวังต้องห้ามตั้งอยู่ทางทิศเหนือของจตุรัสเทียนอันเหมิน นักท่องเที่ยวสามารถเข้าเยี่ยมชมพระราชวังต้องห้ามได้ผ่านทางจตุรัสนี้ผ่านประตูเทียนอันเหมิน '
          'บริเวณรอบจตุรัสเทียนอันเหมินเรียกว่า "อาณาเขตหลวง" มีสถานที่สำคัญรายล้อมอยู่โดยรอบ เช่น มหาศาลาประชาคม '
          'ในอดีต พระราชวังแห่งนี้เป็นเขตหวงห้ามไม่ไห้ประชาชนเข้า แม้แต่ข้าราชการชั้นสูงก็ยังต้องขออนุญาตเป็นกรณีพิเศษ จึงเป็นเหตุที่เรียกพระราชวังนี้ว่า "พระราชวังต้องห้าม" '
          'ยูเนสโกได้ประกาศให้พระราชวังต้องห้ามร่วมกับพระราชวังเฉิ่นหยางเป็นหนึ่งในมรดกโลกในนาม พระราชวังหลวงแห่งราชวงศ์หมิงและราชวงศ์ชิงในปักกิ่งและเฉิ่นหยาง เมื่อ ค.ศ. 1987',
      description:
      'ตื่นตาตื่นใจไปกับความยิ่งใหญ่ของ พระราชวังกู้กง ซึ่งหมายถึงพระราชวังเดิม เรียกอีกอย่างหนึ่งว่า จื่อจิ้นเฉิง แปลว่า พระราชวังต้องห้าม THE FORBIDDEN CITY'
          ' เพราะถือกันว่าจักรพรรดิเปรียบเสมือนบุตรแห่งสวรรค์  พระราชวังจึงเป็นสิ่งต้องห้าม ที่คนธรรมดาสามัญไม่สามารถล่วงล้ำเข้าไปได้ เป็นพระราชวังที่สร้างขึ้นในสมัยจักรพรรดิแห่งราชวงศ์หมิง'
          ' และสืบทอดยาวนานตั้งแต่ราชวงศ์หมิงและชิงรวมทั้งสิ้น 24 พระองค์ มีประวัติศาสตร์ยาวนานกว่า 500 ปี',
      location: 'Dongcheng, Beijing',
    ),
    Tourist_attraction(
      name: 'พระราชวังฤดูร้อน',
      imageURL: 'assets/images/Baijing/bj3.jpg',
      detail:
      'เป็นพระราชวัง อยู่ในกรุงปักกิ่ง ประเทศสาธารณรัฐประชาชนจีน ตั้งอยู่ในบริเวณใกล้เคียงกับพระราชวังหยวนหมิงหยวน'
          ' ห่างจากพระราชวังต้องห้ามไปทางทิศตะวันตกเฉียงเหนือ ประมาณ 8 กิโลเมตร มีพื้นที่ประมาณ 2.9 ตารางกิโลเมตร '
          'ประกอบด้วยเนินเขาสูง 60 เมตร มีพระตำหนักอยู่บนเนิน และทะเลสาบคุนหมิง เป็น 3 ใน 4 ของพื้นที่ทั้งหมด[1] '
          'โดยทะเลสาบนี้เกิดจากการใช้แรงงานคน ขุดดินขึ้นไปถมเป็นเนินเขา สำหรับสร้างพระตำหนักอี๋เหอ-ยฺเหวียนเริ่มก่อสร้างในสมัยราชวงศ์จิน (ค.ศ. 1115 – 1234)'
          ' โดยจักรพรรดิไหหลิงหวัง เมื่อย้ายเมืองหลวงมาอยู่ที่ปักกิ่ง และเป็นที่ประทับของจักรพรรดิราชวงศ์หยวน จนกระทั่งถึงรัชกาลของจักรพรรดิเฉียนหลง แห่งราชวงศ์ชิง'
          ' ทรงบูรณะและสร้างพระตำหนักแห่งใหม่บนเนินเขา ในปี ค.ศ. 1749',
      description:
      'พระราชวังฤดูร้อน “อี้เหอหยวน” ของพระนางซูสีไทเฮา ก่อนหน้านี้เคยเป็นสถานที่ที่เจ้านายผู้ปกครองในระบบศักดินานิยมมาพักผ่อนตากอากาศ'
          ' โดยจักรพรรดิต่อมาอีกหลายพระองค์โปรดเสด็จมาประทับทรงงาน ตลอดจนว่าราชการแผ่นดินที่พระราชวังฤดูร้อนนอกเขตพระราชฐาน จนทำให้พระราชวังฤดูร้อนมีบทบาทสำคัญในด้านเป็นศูนย์กลางทางการเมือง',
      location: 'Xinjiangongmen Rd, Haidian, Beijing',
    ),
  ];

  List Shanghai = [
    Tourist_attraction(
      name: 'หาดไว่ทาน (Waitan)',
      imageURL: 'assets/images/Shanghi/sh1.jpg',
      detail:
      'เป็นพื้นที่ริมน้ำและย่านประวัติศาสตร์ที่ได้รับการคุ้มครองในใจกลางเซี่ยงไฮ้ พื้นที่ดังกล่าวมีศูนย์กลางอยู่ที่ส่วนหนึ่งของถนนจงซาน'
          ' (ถนนจงซานตะวันออกหมายเลข 1) ภายในอดีตนิคมนานาชาติเซี่ยงไฮ้ซึ่งไหลเลียบฝั่งตะวันตกของแม่น้ำหวงผู่ทางทิศตะวันออกของเขตหวงผู่. '
          'พื้นที่ริมแม่น้ำหันหน้าไปทางตึกระฟ้าสมัยใหม่ของLujiazuiในเขตผู่ตง The Bund มักหมายถึงอาคารและท่าเรือบนถนนส่วนนี้ รวมถึงพื้นที่ใกล้เคียงบางส่วน'
          ' จากทศวรรษที่ 1860 ถึง 1930 เมืองนี้เป็นศูนย์กลางที่มั่งคั่งและมีอำนาจของสถานประกอบการต่างชาติในเซี่ยงไฮ้ โดยดำเนินงานในฐานะท่าเรือตามสนธิสัญญาที่ได้รับการคุ้มครองตามกฎหมาย',
      description:
      'เป็นย่านทางเดินยาวกว่า 1,500 เมตรริมแม่น้ำหวงผู่ (Huangpu River) ใจกลางเซี่ยงไฮ้ แม่น้ำแบ่งเมืองออกเป็นสองฝั่ง ฝั่งเมืองเก่าผู่ซี่ (Puxi)'
          ' และฝั่งเมืองใหม่ผู่ตง (Pudong) ซึ่งเดอะบันด์นั้นอยู่ฝั่งเมืองเก่า ริมถนนฝั่งเมืองเก่ามีอาคารรูปทรงสถาปัตยกรรมสไตล์ยุโรปมากมาย'
          ' เพราะในอดีตเคยเป็นทั้งสถานทูตและธนาคาร รับรองว่าไปเดินแล้วรู้สึกเหมือนไม่ได้เดินอยู่ในเอเชียแน่นอน ส่วนฝั่งตรงข้ามเป็นอาคารสูง'
          ' ผู้คนจึงมักจะมาเดินเล่นเพื่อชมความสวยงามของความแตกต่างระหว่างอาคารสองฝั่งนั่นเอง',
      location: 'Zhongshan Rd (E-1), Waitan, Huangpu, Shanghai',
    ),
    Tourist_attraction(
      name: 'หอไข่มุก',
      imageURL: 'assets/images/Shanghi/sh2.jpg',
      detail:
      'ตั้งอยู่ในย่านลู่เจียจุ่ย เขตเมืองใหม่ผู่ตงของนครเซี่ยงไฮ้ ประเทศจีน ทางตะวันออกของแม่น้ำหวงผู่ ซึ่งเต็มไปด้วยตึกระฟ้า '
          'หอไข่มุกตะวันออกเป็นหอส่งสัญญาณวิทยุโทรทัศน์สูง 468 เมตร ลักษณะเป็นไข่มุก 11 ลูก และ เสา 3 เสา ด้านบนเป็นรูปไข่มุก 3 เม็ด 3 ขนาดเรียงกันในแนวตั้ง'
          ' เป็นที่ทำการของสถานีโทรทัศน์ 9 แห่ง และสถานีวิทยุ 10 แห่ง ภายในหอทรงกลมเป็นภัตตาคาร โรงแรมหรูขนาด 25 ห้อง และร้านค้า '
          'ด้านใต้ตรงฐานของหอจัดเป็นพิพิธภัณฑ์ประวัติศาสตร์เมืองเซี่ยงไฮ้เมืองจำลองโลกอนาคต และเมืองวิทยาศาสตร์แฟนตาซี'
          ' ช่องกลางของหอไข่มุกตะวันออกเป็นเสาปล่องกลวง ใช้แขวนลิฟท์ความเร็วสูง 6 ตัวเพื่อขึ้นไปที่จุดชมวิว ในระดับความสูง 267 เมตร'
          ' ส่วนในเวลากลางคืนนั้น หอกลมจะเปิดไฟที่สามารถเปลี่ยนสีไปได้เรื่อยๆ บนไข่มุกเม็ดที่สองจะสามารถมองลงมาข้างล่างได้จากพื่นบางส่วนที่เป็นกระจก'
          ' หอไข่มุกตะวันออกถือเป็นหอคอยที่สูงที่สุดเป็นอันดับ 4 ของโลกเมื่อสร้างเสร็จ และในปัจจุบันสูงเป็นอันดับ 5 ในบริเวณใกล้เคียงกันยังเป็นที่ตั้งของ'
          ' จินเม่าทาวเวอร์ ศูนย์การเงินโลกเซี่ยงไฮ้ และเซี่ยงไฮ้ทาวเวอร์ ปัจจุบันนับได้ว่าเป็นสัญลักษณ์อันโดดเด่นของเมืองเซี่ยงไฮ้ ที่นอกจากจะใช้ในด้านการสื่อสารแล้ว'
          ' ยังเป็นสถานที่ท่องเที่ยวที่ได้รับความนิยมมากที่สุดแห่งหนึ่งของเมืองอีกด้วย',
      description:
      'เป็นหนึ่งในแลนด์มาร์คสำคัญของเซี่ยงไฮ้และของประเทศจีน ตั้งอยู่ฝั่งผู่ตง (Pudong) ย่านเมืองใหม่ของเซี่ยงไฮ้'
          ' หอไข่มุกนั้นเป็นหอส่งสัญญาณวิทยุโทรทัศน์ ที่เรียกว่าหอไข่มุกเพราะมีลักษณะเหมือนไข่มุก 3 เม็ด 3 ขนาดเรียงกันอยู่'
          ' ภายในนอกจากจะเป็นสถานีวิทยุโทรทัศน์แล้วยังมีโรงแรม ร้านอาหาร พิพิธภัณฑ์ และที่สำคัญคือมีจุดชมวิวเซี่ยงไฮ้จากความสูง 267 เมตร'
          ' ทำให้เพื่อนๆ ได้เห็นวิวเซี่ยงไฮ้กันจากมุมสูง นอกจากนั้นยังมีจุดที่เป็นพื้นใส อย่าลืมท้าทายความกล้าด้วยการไปยืนถ่ายรูปมุมพื้นกระจกใสกันด้วยนะ',
      location: 'Lujiazui, PuDong, ShangHai',
    ),
    Tourist_attraction(
      name: 'สวนอี้หยวน',
      imageURL: 'assets/images/Shanghi/sh3.jpg',
      detail:
      'เป็นสวนที่กว้างขวางสวนจีนที่อยู่ข้างวัดเทพเจ้าประจำเมืองทางตะวันออกเฉียงเหนือของเมืองเก่าเซี่ยงไฮ้ที่เขตหวงผู่ '
          'นครเซี่ยงไฮ้ ติดกับ Yuyuan Tourist Mart , Huxinting Teahouse และ Yu Garden Bazaar'
          'สวนแห่งนี้สามารถเข้าถึงได้จาก สถานี รถไฟใต้ดิน Shanghai Metroสาย10 และ Line 14 สถานี Yuyuan Garden '
          'ชิ้นสำคัญคือหินหยกประณีต (玉玲珑) ซึ่งเป็นก้อนหินขนาด 5 ตันที่มีรูพรุนขนาด 3.3 เมตร '
          'ข่าวลือเกี่ยวกับต้นกำเนิดรวมถึงเรื่องราวที่มีความหมายสำหรับจักรพรรดิ Huizong ( ราชวงศ์ซ่งเหนือตั้งแต่ปี 1100 ถึง 1126 AD)'
          ' ที่สวนจักรพรรดิในBianjingแต่ถูกกู้จากแม่น้ำ Huangpu หลังจากที่เรือที่บรรทุกมาจมลง ',
      description:
      'สวนที่สร้างมาตั้งแต่สมัยราชวงศ์หมิง เป็นสวนจีนขนาดใหญ่ที่สุดในสมัยนั้น มีเนื้อที่กว่า 12 ไร่ด้วยกัน'
          ' ภายในมีสิ่งปลูกสร้างสไตล์จีนโบราณกว่า 20 หลัง เชื่อมต่อกันด้วยสะพานข้ามน้ำท่ามกลางสวนที่มีต้นไม้ใหญ่'
          ' ดอกไม้ และหินสวยงามหายากมากมาย ที่ต้องไปดูให้ได้เลยคือภูเขาจำลองที่ทำขึ้นด้วยหินสีเหลืองสูงกว่า 14 เมตร นับเป็นสวนจีนที่มีความสวยงามและสมบูรณ์มากแห่งหนึ่ง',
      location: 'YuYuanLaoJie, Huangpu, Shanghai',
    ),
  ];

  List Xian = [
    Tourist_attraction(
      name: "BELL TOWER AND DRUM TOWER",
      imageURL: 'assets/images/Xian/xa1.jpeg',
      detail: 'ตั้งอยู่ใจกลางเมืองซีอาน สำหรับตัวหอระฆังนั้นสร้างจากอิฐและไม้ เป็นอาคารหลังคาสามชั้น '
          'มีความสูงทั้งหมด 36 เมตร หอระฆังแห่งนี้เริ่มสร้างเมื่อปีที่ 17 สมัยจักรพรรดิหงอู่แห่งราชวงศ์หมิง '
          'เป็นรูปแบบศิลปะสถาปัตยกรรมที่เด่นชัดของราชวงศ์หมิง เป็นหอระฆังที่มีขนาดใหญ่ที่สุด และรักษาไว้สมบูรณ์แบบที่สุดของจีนโบราณที่สืบทอดจนถึงปัจจุบัน'
          ' ส่วนหอกลองนั้นสร้างในปี ค.ศ. 1380 ซึ่งเป็นยุคการปกครองของฮองวู ฮ่องเต้แห่งราชวงศ์หมิง ผ่านการบูรณะสองครั้งสองคราในราชวงศ์ชิง '
          'อาคารสองชั้นที่รับน้ำหนักด้วยผนังหลังนี้สูง 34 เมตร มีความยาวจากตะวันออกจรดตะวันตก 52.6 เมตร และความกว้างจากเหนือจรดใต้ 38 เมตร '
          'สถาปัตยกรรมของหอกลอง เป็นการผสมผสานระหว่างรูปแบบศิลปะราชวงศ์ถังและราชวงศ์ชิง รวมทั้งมีรายละเอียดของนวัตกรรมบางอย่างแต้มเติมอยู่ด้วย '
          'อย่างเช่น มีการอ้างว่าในหอกลองไม่มีการใช้ตะปูเหล็กสักตัวเดียว หอคอยทั้งสองได้ชื่อว่าเป็น “ตึกสองพี่น้อง” หรือ “ระฆังรุ่งอรุณและกลองรัตติกาล” '
          'เนื่องจากประเทศจีนในอดีตโดยเฉพาะราชวงศ์หยวนนั้น จะมีการตีกลองเพื่อบอกเวลาและเตือนภัยยามมีสถานการณ์ฉุกเฉิน โดยการให้สัญญาณบอกเวลานั้น '
          'ยามเช้าใช้เสียงระฆัง และยามค่ำใช้เสียงกลอง',
      description: 'อยู่ใกล้กับจุดศูนย์กลางของเมือง ตั้งเด่นสง่างาม เป็นหอคอยที่ถูกสร้างมาตั้งแต่ราชวงศ์หมิง ซึ่งการมีหอระฆังและหอกลอง'
          ' ในอดีต ใช้สำหรับตีบอกเวลาในแต่ละวัน ในยุคปัจจุบันที่ไม่ต้องใช้แล้ว จึงกลายเป็นสถานที่ท่องเที่ยวทางประวัติศาสตร์ กลางคืนถ่ายรูปสวย และนับว่าเป็นหอคอยที่ใหญ่ที่สุดในจีนอีกด้วย',
      location: 'Beiyuanmen, Lianhu District, Xi An, Shaanxi, China',
    ),
    Tourist_attraction(
      name: "EMPEROR QINSHIHUANG'S MAUSOLEUM",
      imageURL: 'assets/images/Xian/xa2.jpeg',
      detail: 'สุสานจิ๋นซีฮ่องเต้ถือเป็นหนึ่งในมรดกโลกทางวัฒนธรรมของจีน โดยตั้งอยู่ที่เมืองซีอาน มณฑลส่านซี'
          ' โดยในขณะนี้การขุดสุสานทั้งหมดยังไม่เสร็จสิ้น และทางรัฐบาลจีนเองก็ยังไม่มีเส้นตายว่าการขุดสำรวจจะต้องเสร็จภายในเมื่อใด'
          ' โดยเหตุผลหลักเพราะการที่จะขุดสำรวจเพื่อนำตุ๊กตาดินเผาขึ้นมานั้น จะต้องใช้เทคโนโลยีและความระมัดระวังอย่างสูงเพื่อไม่ให้สีที่ติดที่อยู่บนตัวตุ๊กตาดินเผาลอกออก'
          'สุสานจิ๋นซีฮ่องเต้นี้ถูกค้นพบโดยบังเอิญในปี 1974 เมื่อกลุ่มชาวนาในพื้นที่จะไปขุดหาบ่อน้ำ แต่ว่าไปค้นพบเครื่องปั้นดินเผาโบราณ'
          ' ก่อนที่จะแจ้งทางการและเกิดการขุดขนานใหญ่จนพบตุ๊กตาดินเผาจำนวนมาก ทั้งนี้ ในพื้นที่พิพิธภัณฑ์สุสานจิ๋นซีฮ่องเต้ มีห้องโถงสุสานหลักๆ ทั้งสิ้น 3 ห้อง '
          'โดยห้องแรกเป็นห้องขนาดใหญ่ที่สุด มีการขุดค้นพบตุ๊กตาดินเผา นำมาบูรณะ และนำมาจัดยืนเรียงตามเดิมแล้ว ซึ่งถูกวางอยู่ในตำแหน่งคล้ายการจัดทัพสำหรับออกรบ '
          'โดยกลุ่มที่อยู่หน้าสุดเป็นเหมือนทหารหน่วยกล้าตาย พลธนูอยู่ด้านหลังห่างออกไป เป็นต้น  หุ้นปั้นดินเผาทั้งหมดที่อยู่ในห้องนี้มีทั้งหมดประมาณ 6 พันตัว'
          'ส่วนห้องที่ 2 มีขนาดเล็กกว่า และพื้นที่จำนวนมากของห้องนี้ยังไม่ถูกขุดเพื่อนำตุ๊กตาดินเผาออกมา โดยสาเหตุหลักก็เพื่อเหตุผลด้านการอนุรักษ์ '
          'เนื่องจากสีที่อยู่บนตัวตุ๊กตาดินเผาเหล่านี้ เมื่อถูกขุดเปิดหน้าดินขึ้นมาแล้วสัมผัสอากาศ สีที่อยู่บนตัวตุ๊กตาดินเผาจะเกิดการทำปฏิกิริยาทางเคมีกับอากาศ '
          'และทำให้สีหายไปในเวลาเพียงไม่กี่วินาที ซึ่งนี่เป็นสิ่งที่เกิดขึ้นกับตุ๊กตาดินเผาในห้องที่ 1 จึงทำให้ตุ๊กตาในห้องที่ 1 กว่า 6 พันตัวแทบจะไม่เหลือสีติดอยู่ที่ตัวตุ๊กตาดินเผาเลย'
          'ทางรัฐบาลจีนเองได้มีการนำเทคโนโลยีมาใช้ในการสำรวจและอนุรักษ์มรดกทางวัฒนธรรมเหล่านี้ โดยในหลุมที่ 2 นี้ ได้มีการใช้เครื่องเอ็กซเรย์สำรวจดูสิ่งที่อยู่ใต้ดินทั้งหมดแล้ว'
          ' และพบว่าด้านล่างมีตุ๊กตาดินเผาจำนวนมากเหมือนห้องโถงที่ 1 เพียงแต่ว่าการขุดสำรวจจะเป็นไปแบบค่อยเป็นค่อยไปเพื่อรักษาสีของหุ่นปั้นดินเผาไว้ให้ได้มากที่สุด'
          'ส่วนห้องโถงที่ 3 แม้จะมีขนาดเล็กที่สุด แต่คาดการณ์กันว่ามีความสำคัญมาก เพราะว่าตัวหุ้นปั้นดินเผาในห้องนี้แต่งตัวในลักษณะที่ดูเหมือนเป็นนายทหารระดับสูง'
          ' อีกทั้งยังถูกวางยืนอยู่ในลักษณะหันหน้าเข้าหากันคล้ายกำลังปรึกษาหารือกันอยู่และสุดท้ายคือสุสานของตัวจิ๋นซีฮ่องเต้เอง '
          'เป็นเนินดินที่อยู่ห่างออกไปจากส่วนที่เป็นที่ฝังตุ๊กตาดินเผาทหารเหล่านี้ประมาณ 1.5 กิโลเมตร แต่ว่าจนถึงปัจจุบันยังไม่ได้มีการขุดค้น ทางการจีนยังปล่อยให้เป็นเนินดินทิ้งไว้ตามเดิม',
      description: 'สถานที่สุดสะพรึง และเป็นหลักฐานทางประวัติศาตร์ กับสุสานจิ๋นซี ฮ่องเต้ ซึ่งเต็มไปด้วยรูปปั้นกองทัพทหารดินเผา '
          'รูปร่างหน้าตาเหมือนคนจริงๆ แถมหน้าตาก็ไม่ซ้ำกัน ยืนอยู่รอบสุสาน พร้อมม้าและรถศึก นอกจากนี้ภายในสุสานยังมีการจัดแสดงโบราณวัตถุที่มีอายุกว่า2,000 ปีอีกด้วย',
      location: 'Lintong District, Xi An, Shaanxi, China',
    ),
    Tourist_attraction(
      name: "XI’AN CITY WALL (SOUTH GATE)",
      imageURL: 'assets/images/Xian/xa3.jpeg',
      detail: 'เมืองซีอาน เมืองหลวงโบราณของจีน เป็นหนึ่งในกำแพงเมืองของจีนที่เก่าแก่ที่สุด ขนาดใหญ่ที่สุด และรักษาไว้ได้ดีที่สุด '
          'ถูกสร้างขึ้นภายใต้การปกครองของจักรพรรดิหงหวู่ หรือ จูหยวนจาง เป็นระบบการป้องกันทางทหาร สะท้อนถึงแนวคิด ความสมบูรณ์ของสถาปัตยกรรมเชิงเทินของระบบสังคมศักดินา'
          'ได้รับการตกแต่งใหม่หลายครั้งนับตั้งแต่สร้างขึ้นในคริสศตวรรษที่ 14 ได้แก่ 3 ครั้ง ในระยะเวลาเพียง 200 ปี ในปลายปี 1500 และ 1700 และล่าสุดในปี ค.ศ. 1983 '
          'กำแพงล้อมรอบพื้นที่ประมาณ 14 ตารางกิโลเมตร (5.4 ตารางไมล์) [3]กำแพงเมืองซีอานอยู่ใน บัญชีรายชื่อเบื้องต้น (Tentative List) '
          'เผื่อเตรียมเสนอขึ้นเป็นมรดกโลกขององค์การยูเนสโกในอนาคต ภายใต้ชื่อ "กำแพงเมืองของราชวงศ์หมิงและราชวงศ์ชิง" นับตั้งแต่ปี ค.ศ. 2008 '
          'และอยู่ในรายชื่อของมรดกทางวัฒนธรรมของสาธารณรัฐประชาชนจีน ตั้งแต่เดือนมีนาคม ค.ศ. 1961 กำแพงเมืองซีอานเป็นมรดกทางประวัติศาสตร์และวัฒนธรรมแห่งชาติ',
      description: 'กำแพงเมืองโบราณที่สมบูรณ์ที่สุดของจีน ที่มามาตั้งแต่สมัยราชวงศ์หมิง มีความยาวเกือบ 14 กิโลเมตร ล้อมรอบเมืองเก่าของเมืองเอาไว้'
          ' ความกว้างของกำแพงเมืองนี้ ทำให้ผู้คนสามารถมาทำกิจกรรม เดิน วิ่ง ปั่นจักรยานได้ด้วย',
      location: ' China, Shaanxi, Xi An, Beilin, China',
    ),
  ];

  List Chengdu = [
    Tourist_attraction(
      name: 'Wuhou Temple',
      imageURL: 'assets/images/Chengdu/ct1.jpg',
      detail: 'วัดที่เก่าแก่ที่สุดในเมืองเฉิงตู สร้างขึ้นเพื่ออุทิศให้แก่จูกัดเหลียง (Zhuge Liang) หรือขงเบ้ง มีพื้นที่ทั้งหมดประมาณ 37,000 ตารางกิโลเมตร '
          'ไม่มีหลักฐานที่แน่ชัดว่าสร้างขึ้นเมื่อใด แต่มีการบูรณะในปี ค.ศ. 1672 ในส่วนหลักของวัดวูเฮาถูกแบ่งออกเป็น 5 ส่วน ไล่ไปตั้งแต่ทางด้านใต้ขึ้นเหนือ '
          'คือส่วนของประตูทางเข้า, ประตูที่สอง, ส่วนจัดแสดงเกี่ยวกับเล่าปี่, บริเวณทางเดิน และส่วนจัดแสดงเกี่ยวกับขงเบ้ง สิ่งที่มีคุณค่าทางด้านวัฒนธรรมของวัดวูเฮา '
          'คือ "ศาลาเสาหิน" สร้างขึ้นในปี ค.ศ. 809 สูง 372 เซนติเมตร และกว้าง 95 เซนติเมตร ถูกเรียกว่า ศาลาเสาหินแห่งความสำเร็จ 3 ประการ (Triple-Success Stele)',
      description: 'วัดที่เก่าแก่ที่สุดในเมืองเฉิงตู สร้างขึ้นเพื่ออุทิศให้แก่จูกัดเหลียง (Zhuge Liang) หรือขงเบ้ง '
          'บุคคลสำคัญในยุคสามก๊ก (ค.ศ. 220-280) ตั้งอยู่ชานเมืองทางตอนใต้ของเมืองเฉิงตู',
      location: 'Wuhouyu Street, Wuhou District, Chengdu',
    ),
    Tourist_attraction(
      name: 'Jiuzhaigou Valley',
      imageURL: 'assets/images/Chengdu/ct3.jpg',
      detail: 'หุบเขาจิ่วจ้ายโกว มีทัศนียภาพและธรรมชาติที่งดงามดั่งเป็นสวรรค์บนดิน '
          'ครอบคลุมเนื้อที่ประมาณ 600 ตารางกิโลเมตร ประกอบไปด้วยทะเลสาบสีฟ้าใส น้ำตก ป่าเขียวขจี '
          'ภูเขาที่ปกคลุมไปด้วยหิมะ และวัฒนธรรมพื้นบ้านของชาวทิเบต (Tibetan) และเชียง (Qiang) '
          'สิ่งที่โดดเด่นที่สุดในหุบเขาแห่งนี้ก็คือ ทะเลสาบสีฟ้า ซึ่งเกิดจากการที่มีแร่ธาตุอยู่ในพื้นดินใต้ทะเลสาบ '
          'จึงทำให้มันสะท้อนขึ้นมาบนน้ำ กลายเป็นสีฟ้าสวยใส นอกจากนี้ยังมีพืชยืนต้นอีกกว่า 2,576 สายพันธุ์ '
          'พืชล้มลุกและคลุมหน้าดินอีกกว่า 400 สายพันธุ์ สัตว์ป่ามีกระดูกสันหลัง 170 สายพันธุ์ นกนานาชนิดกว่า 140 สายพันธุ์ '
          'และสัตว์ป่าหายากอีกประมาณ 17 สายพันธุ์',
      description: 'ทัศนียภาพและธรรมชาติที่งดงามดั่งเป็นสวรรค์บนดิน ครอบคลุมเนื้อที่ประมาณ 600 ตารางกิโลเมตร ประกอบไปด้วยทะเลสาบสีฟ้าใส '
          'น้ำตก ป่าเขียวขจี ภูเขาที่ปกคลุมไปด้วยหิมะ และวัฒนธรรมพื้นบ้านของชาวทิเบต (Tibetan) และเชียง (Qiang)',
      location: 'Jiuzhaigou County, Ngawa Tibetan and Qiang Autonomous Prefecture, Sichuan, China',
    ),
    Tourist_attraction(
      name: 'Jinli Ancient Street',
      imageURL: 'assets/images/Chengdu/ct2.jpeg',
      detail: 'เป็นถนนคนเดินอยู่ติดกับศาลเจ้าสามก๊ก หรือศาลเจ้าขงเบ้ง(จูกัดเหลียง) บุคคลสำคัญในยุคสามก๊ก (ค.ศ. 220-280)'
          'ใครที่ชอบบ้านเมืองแบบจีนโบราณ และเป็นแฟนสามก๊กไม่ควรพลาดถนนคนเดินเก่าแก่แห่งนี้ '
          'ประตูทางเข้าจะสามารถทำให้เห็นถึงบรรยากาศเหมือนเดินในหมู่บ้านหนังจีนสมัยก่อน ถ้ามาช่วงที่มีเทศกาลโคมไฟจะสวยงามมาก '
          'ที่นี่มีร้านค้ามากมายที่ตกแต่งอยู่ในบ้านหลังเก่าของจีน มีสินค้าพื้นเมืองและขนมต่าง ๆ รวมทั้งของฝากของขายเป็นจำนวนมาก'
          'ที่นี่มีร้านอาหารที่แสดงโชว์ขึ้นชื่อของเมืองนี้ คือ โชว์เปลี่ยนหน้ากาก รายทางจะมีขายของที่ระลึกของเมืองเฉิงตูทั้งตัวละครในสามก๊ก '
          'รูปปั้นองค์โพธิสัตว์ องค์เทพองค์เซียนตามนักษัตรปีเกิด ตุ๊กตาเปลี่ยนหน้ากากที่มีให้เลือกหลายแบบหลายสี กระทั่งตุ๊กตาหมีแพนด้าแบบต่างๆ '
          'สามารถเลือกซื้อ เลือกชิมสินค้าต่าง ๆ ได้ตามใจชอบ แนะนำให้ลองอาหารหรือขนมพื้นเมืองของเฉิงตู อย่างแป้งทอดไส้น้ำตาลแดง '
          'โยเกิร์ตสดเสฉวน หัวกระต่ายทอดหรือย่าง มีขายมากมายตามทางเดิน'
          'คือ "ศาลาเสาหิน" สร้างขึ้นในปี ค.ศ. 809 สูง 372 เซนติเมตร และกว้าง 95 เซนติเมตร ถูกเรียกว่า ศาลาเสาหินแห่งความสำเร็จ 3 ประการ (Triple-Success Stele)',
      description: 'เป็นถนนคนเดินอยู่ติดกับศาลเจ้าสามก๊ก หรือศาลเจ้าขงเบ้ง(จูกัดเหลียง) บุคคลสำคัญในยุคสามก๊ก (ค.ศ. 220-280)'
          'ใครที่ชอบบ้านเมืองแบบจีนโบราณ และเป็นแฟนสามก๊กไม่ควรพลาดถนนคนเดินเก่าแก่แห่งนี้',
      location: 'China, Sichuan Sheng, Chengdu Shi, Wuhou Qu, Wu Hou Ci, Wuhouci St',
    ),
  ];

  List Guangzhou = [
    Tourist_attraction(
      name: 'FIVE RAMS STATUE',
      imageURL: 'assets/images/Guangzhou/cz3.jpeg',
      detail: 'อนุสาวรีย์แพะ 5 ตัว เป็นอนุสาวรีย์ที่สร้างขึ้นด้วยหินแกรนิต 120 ก้อน '
          'แกะสลักและประกอบกันเป็นรูปแพะ 5 ตัว ซึ่งเป็นสัญลักษณ์ประจำเมืองกวางโจว จากเรื่องเล่าที่ว่าในอดีตนั้น '
          'เมืองกวางโจวมีความอดอยากแร้นแค้นเป็นอย่างมาก จนกระทั่งในวันหนึ่งได้มีเทวดา 5 องค์ขี่แพะ 5 ตัวที่คาบรวงข้าว 6 รวงลงมาจากสวรรค์ '
          'และเทวดาได้มอบรวงข้าวนั้นให้กับชาวเมืองกวางโจว พร้อมอวยพรให้เมืองนี้พ้นจากความอดอยาก เต็มไปด้วยความอุดมสมบูรณ์ตลอดเวลา '
          'ซึ่งหลังจากนั้นเมืองกวางโจวก็ได้มีความเจริญรุ่งเรืองเป็นอย่างมากมาจนถึงในปัจจุบัน ทำให้ชาวเมืองกวางโจวซาบซึ้งในบุญคุณ และได้ตั้งอนุสาวรีย์แพะห้าตัวขึ้นมาเพื่อเป็นการรำลึกถึงเรื่องราวนี้',
      description: 'อนุสาวรีย์แพะ 5 ตัว (Five Rams Statue) ซึ่งตั้งอยู่ในสวนสาธารณะเยี่ยซิ่ว เป็นสัญลักษณ์ที่แสดงถึงความอุดมสมบูรณ์'
          ' มั่งคั่งของกวางโจว  ถูกสร้างขึ้นด้วยหินแกรนิต 120 ก้อน แกะสลักเป็นรูปแพะ 5 ตัว ลายละเอียดสวยงาม ประณีต ตามความเชื่อ '
          'จากเทวดาขี่แพะ ที่ทำให้เมืองกวางโจวเจริญรุ่งเรืองขึ้นมา',
      location: 'Yuexiu District, Guangzhou, China',
    ),
    Tourist_attraction(
      name: 'SHANGXIAJIU PEDESTRIAN STREET',
      imageURL: 'assets/images/Guangzhou/gz1.jpg',
      detail: 'เป็นถนนคนเดินที่มีชื่อเสียงของเมืองกวางโจว ซึ่งจำหน่ายสินค้าหลากหลายชนิดทั้งอาหาร สินค้าแฟชั่น '
          'และของที่ระลึกต่างๆ จากร้านค้าทั้งหมดกว่า 300 ร้าน ตลอดความยาวถนน 1.2 กิโลเมตร ตั้งอยู่ที่เมืองกวางโจว ประเทศจีน'
          'ถนนซ่างเซี่ยจิ่ว เป็นถนนสายธุรกิจแห่งแรกของเมืองกวางโจว ซึ่งเปิดทำการตั้งแต่ปี ค.ศ. 1995 เป็นต้นมา '
          'พื้นที่โดยยรอบเป็นย่านเมืองเก่าซีกวน (Xiguan) ซึ่งมีลักษณะอาคารทั้งสไตล์จีนและสไตล์ยุโรปผสมกันไป '
          'และยังเต็มไปด้วยตรอกต่างๆอีกจำนวนมาก ซึ่งบรรยากาศของถนนคนเดินแห่งนี้จะมีความคึกคักเป็นพิเศษตั้งแต่ช่วงเย็น ไปจนถึงตอนค่ำของทุกวัน',
      description: 'เป็นถนนคนเดินที่มีชื่อเสียงมากในเมืองกวางโจว เปิดมาตั้งแต่ปี ค.ศ. 1995 บรรยากาศคึกคัก'
          ' โดยบรรยากาศรอบๆ จะเป็นตึกสไตล์จีนผสมบุโรป มีร้านค้าจำหน่ายสินค้าหลากหลาย ทั้งเสื้อผ้า แฟชั่น ของกิน ของที่ระลึก มากกว่า 300 ร้าน',
      location: 'China, Guangdong Province, Guangzhou, Liwan District',
    ),
    Tourist_attraction(
      name: 'NANSHA TIANHOU TEMPLE',
      imageURL: 'assets/images/Guangzhou/gz2.jpg',
      detail: 'วัดหนานซา เทียนหัว เป็นวัดที่สร้างขึ้นเพื่อเป็นวัดของม่าจ้อโป๋ หรือ เจ้าแม่หม่าโจ้ว '
          'เทพเจ้าสตรีที่ได้รับความเคารพในหมู่ของชาวฮกเกี้ยน ชาวแต้จิ๋ว และชาวจีนโพ้นทะเลในฐานะเทพเจ้าแห่งท้องทะเล '
          'ซึ่งตัววัดแห่งนี้ได้รับการยกย่องว่าเป็นวัดเจ้าแม่หม่าโจ้วที่ใหญ่ที่สุดในภูมิภาคเอเชียตะวันออกเฉียงใต้ '
          'ตั้งอยู่ในเขตหนานซา เมืองกวางโจว ประเทศจีน วัดหนานซา เทียนหัว แต่เดิมนั้นถูกสร้างขึ้นในยุคราชวงหมิง (ค.ศ. 1368-1644) '
          'และมีการตกแต่งเพิ่มเติมเรื่อยมาจนถึงในยุคราชวงศ์ชิง (ค.ศ. 1644 – 1911) แต่หลังจากนั้นไม่นานกลับพังทลายลงมา โดยตัววัดที่เห็นในปัจจุบันนั้นเกิดจากการสร้างขึ้นใหม่ในปี 1994'
          'เมื่อก้าวเข้าสู่ตัววัด นักท่องเที่ยวจะพบกับจัตุรัสเทียนหัว (Tianhua Square) ซึ่งมีลักษณะเป็นลานกว้างขนาดใหญ่ และรูปปั้นเจ้าแม่หม่าโจ้วที่มีความสูง 14.5 เมตร '
          'สร้างขึ้นจากหินแกรนิตจำนวน 365 ชิ้น ซึ่งเป็นสัญลักษณ์ว่าเจ้าแม่หม่าโจ้วนั้นจะคอยอวยพรและปกปักรักษาเหล่าชาวประมงที่ออกเดินเรือ รวมถึงผู้ที่มากราบไหว้บูชาไปตลอดทั้งปี '
          'และที่ด้านหลังของรูปปั้นก็คือตัวอาคารหลักของวัดที่สร้างขึ้นตามแนวภูเขา ซึ่งยังมีทั้งหอคอยและป้อมปราการอยู่ในบริเวณเดียวกัน',
      description: 'ถูกสร้างขึ้นตั้งแต่สมัยราชวงศ์หมิง ด้านหน้าตัววัด จะเห็นรูปปั้นเจ้าแม่หม่าโจ้วที่มีความสูง 14.5 เมตร สร้างขึ้นจากหินแกรนิตจำนวน'
          ' 365 ชิ้น ซึ่งเจ้าแม่หม่าโจ้ว เปรียบเสมือนเทพเจ้าสตรี ที่ชาวจีนเคารพและเชื่อในการปกปักรักษาชาวประมงที่ออกเดินเรือ มีนักท่องเที่ยวแวะเวียนมากราบไหว้ตลอดปี',
      location: ' China, Guangdong Province, Shenzhen, Nanshan',
    ),
  ];

  List Guilin = [
    Tourist_attraction(
      name: 'Elephant Trunk Hill',
      imageURL: 'assets/images/Guilin/gl1.png',
      detail: 'ตั้งอยู่ใจกลางเมืองตรงบริเวณจุดบรรจบของแม่น้ำหลีเจียงและแม่น้ำถาวฮัวเป็นหนึ่งในภูเขาที่ขึ้นชื่อของกุ้ยหลิน '
          'ทางตะวันออกเฉียงใต้สุดเขตเมืองกุ้ยหลิน ริมแม่น้ำหลีเจียง เป็นสัญลักษณ์ของเมืองกุ้ยหลิน ที่ได้ชื่อว่าเขางวงช้างนั้น '
          'มาจากรูปร่างของภูเขาหินที่คล้ายกับงวงของช้างที่กำลังโน้มลงเพื่อกินน้ำจากแม่น้ำหลีเจียงที่อยู่เบื้องล่าง บริเวณชายฝั่งแม่น้ำบริเวณนี้ได้รับความนิยมจากนักท่องเที่ยวมาก '
          'ที่ใต้เขายังมี “ถ้ำคืนไข่มุก”เป็นจุดสนใจ ซึ่งว่ากันว่าเคยมีมังกรอาศัยอยู่ภายในถ้ำแห่งนี้ ปัจจุบันถ้ำคืนไข่มุกนับเป็นอีกหนึ่งแหล่งท่องเที่ยวสำคัญในกุ้ยหลิน '
          'ที่ภายในถ้ำโดดเด่นด้วยพระพุทธรูปแกะสลักหินที่ผนังถ้ำส่วนทางด้านฝั่งริมแม่น้ำหลีของถ้ำยังมีเสาหินที่ตามตำนานจีนเล่าว่า '
          'ยอดขุนพลของจีนคนหนึ่งที่มีรูปปั้นตั้งโดดเด่นอยู่หน้าเขาสลายคลื่นได้แสดงบารมีให้นักรบเวียดนามดู โดยใช้ดาบเดียวฟันฉับลงที่เสาหินจนขาดสะบั้นในดาบเดียวจุดท่องเที่ยวที่น่าสนใจ '
          'ในบริเวณเขางวงช้าง อาทิ ถ้ำจันทร์วารี (สุ่ยเยว์) ผาเนตรกุญชร เจดีย์ผู่เสียน วัดหงเฟิง ซึ่งภายในวัดเป็นที่แสดงหลักฐานทางประวัติศาสตร์ของไท่ผิงเทียนกั๊ว '
          'ข้างเตียงยังมีเจดีย์เส้อลี่แห่งวัดไคหยวน ซึ่งเป็นวัดโบราณ ที่เริ่ม สร้างในสมัยราชวงศ์สุย (ค.ศ. 581-617) แต่เสร็จสิ้นในสมัยราชวงศ์ถัง (ค.ศ. 618-907)'
          ' ถ้ำจันทร์วารีอยู่ติดริมแม่น้ำ หลีเจียง สายน้ำไหลทะลุ หินผาและดูเหมือนกับพระจันทร์ลอยอยู่เหนือน้ำ ส่วนหินเหนือถ้ำย้อยลง แม่น้ำเหมือนงวงช้างที่ยื่นลงเพื่อ'
          ' ดื่มน้ำจากแม่น้ำหลีเจียง แลดูน่าทึ่งและสวยงามยิ่งนัก นักกวีสมัยถังซ่ง เมื่อได้มาเยือนเขางวงช้าง แล้วประทับใจจนบรรยายเป็นบทกลอนดังนี้ใต้น้ำมีจันทราสว่างไสวเหนือน้ำมีจันทราลอยเด่น'
          ' สายน้ำไหลแต่จันทรายัง จันทร์ลับฟ้าสายน้ำยังคงไหล',
      description: 'เขางวงช้างคือสัญลักษณ์ของเมืองนี้ โดยจะตั้งอยู่ที่ริมแม่น้ำหลี่เจียง ซึ่งแน่นอนว่าภายนอกจะมีลักษณะคล้ายกับงวงช้าง '
          'แต่ภายใต้ของเขาแห่งเมืองกุ้ยหลินนี้จะมีถ้ำมังกรที่ข้างในมีพระพุทธรูปโบราณประดิษฐานอยู่',
      location: 'China, Guangxi Zhuangzuzizhiqu, Guilin Shi, Xiangshan Qu',
    ),
    Tourist_attraction(
      name: 'Ludi Yan(Reed Flute Cave)',
      imageURL: 'assets/images/Guilin/gl2.png',
      detail: 'ถ้ำขลุ่ยอ้อ (Reed Flute Cave) ในกุ้ยหลิน ที่เป็นเครื่องพิสูจน์ว่าความงดงามจำเป็นต้องใช้เวลาในการสร้าง '
          'ถ้ำขลุ่ยอ้อ หรือรู้จักกันอีกชื่อหนึ่งว่า “พระราชวังแห่งศิลปะธรรมชาติ” มีอายุมากว่า 180 ล้านปีและได้ดึงดูดนักท่องเที่ยวมายาวนานกว่าพันปี '
          'ก้าวเข้าสู่ตัวถ้ำและตื่นตะลึงไปกับความงามของหินงอก หินย้อย เสาหิน และอีกมากมายที่การกัดเซาะของน้ำภายในถ้ำมามากกว่าพันปี '
          'และไฮไลท์ทีเด็ดของที่นี่ก็คือ ส่วนของ “วังบาดาล” วังน้ำที่มีหินงอกหินย้อยทอดเงาตกสะท้อนภายใต้แสงไฟสีน้ำเงิน ท่ามกลางโถงถ้ำขนาดใหญ่'
          'ภายในโถงของถ้ำจะเต็มไปด้วยโครงสร้างที่คดงอ สูงโปร่ง และหินที่งอกลงมาจากเพดาน สว่างไสวไปด้วยแสงไฟหลากสีที่ทำให้ถ้ำดูราวกับมีมีมนตร์ขลัง '
          'ให้ความรู้สึกเหมือนกำลังก้าวเข้าไปสู่โลกใหม่ และที่สำคัญคุณจะได้ถ่ายรูปกับความงามธรรมชาติที่เกิดจากการก่อตัวของหินในแบบที่เพื่อนๆ ไม่มีวันลืม',
      description: 'มีหินงอกหินย้อยเป็นจุดเด่น และต้องขอบอกเลยว่าสวยงามมากๆ '
          'เพราะนอกจากหินงอกหินย้อยจะมีรูปร่างอันเป็นเอกลักษณ์แล้ว ภายในถ้ำแห่งนี้ยังมีการจัดไฟประดับอีกด้วย ซึ่งช่วยเพิ่มความสวยงามได้อย่างดีเลยทีเดียว',
      location: 'Ludi Rd, Xiufeng Qu, Guilin Shi, Guangxi Zhuangzuzizhiqu, China',
    ),
    Tourist_attraction(
      name: 'Lijiang River',
      imageURL: 'assets/images/Guilin/gl3.png',
      detail: 'ล่องเรือแม่น้ำลี่เจียง (Li River) อีกหนึ่งไฮไลต์ของกุ้ยหลินที่ไม่ควรพลาด '
          'เพื่อนๆ จะได้สัมผัสกับประสบการณ์การชมวิวธรรมชาติในกุ้ยหลินที่สมบูรณ์แบบมากที่สุด ตลอดสายน้ำเต็มไปด้วยป่าเขาและถ้ำรูปร่างแปลกตามากมาย '
          'ถือว่าเป็นความมหัศจรรย์ที่ธรรมชาติบรรจงสร้างสรรค์ไว้ขึ้นมาได้อย่างลงตัว ความงามเหล่านี้กลายเป็นที่ร่ำลือกันมาช้านาน '
          'และนี่ก็เป็นที่มาของคำว่า "เมืองสวรรค์บนพื้นพิภพ"และช่วงเวลาที่เหมาะสำหรับการล่องแม่น้ำมากที่สุดก็คือฤดูน้ำหลาก ในช่วงเดือนเมษายนถึงสิงหาคม '
          'เพื่อล่องเรือไปตามแม่น้ำหลีเจียงถือเป็นการพักผ่อนหย่อนใจที่ดีที่สุด นับเป็นความทรงจำที่ใครไปเที่ยวกุ้ยหลินแล้วจะประทับใจไม่รู้ลืม ขอบอกว่า '
          'ใครมากุ้ยหลินแล้วไม่ได้ล่องแม่น้ำ ต้องถือว่ามาไม่ถึงนะ',
      description: 'เล่องเรือแม่น้ำลี่เจียง (Li River) อีกหนึ่งไฮไลต์ของกุ้ยหลินที่ไม่ควรพลาด '
          'เพื่อนๆ จะได้สัมผัสกับประสบการณ์การชมวิวธรรมชาติในกุ้ยหลินที่สมบูรณ์แบบมากที่สุด ตลอดสายน้ำเต็มไปด้วยป่าเขาและถ้ำรูปร่างแปลกตามากมาย '
          'ถือว่าเป็นความมหัศจรรย์ที่ธรรมชาติบรรจงสร้างสรรค์ไว้ขึ้นมาได้อย่างลงตัว ความงามเหล่านี้กลายเป็นที่ร่ำลือกันมาช้านาน',
      location: 'Fulong Garden, Linjiang Road, Qixing District, Qixing, Guilin, China',
    ),
  ];

  List Kunming = [
    Tourist_attraction(
      name: 'CUIHU LAKE',
      imageURL: 'assets/images/Kunming/km1.jpg',
      detail: 'สระมรกต หรือที่เรียกกันว่า “ทะเลสาบกรีนเลค” เป็นสวนสาธารณะที่มีขนาดใหญ่ใจกลางนครคุนหมิงและล้อมรอบด้วยบึงน้ำ เหมาะแก่การเดินเล่น พักผ่อนหย่อนใจ และออกกำลังกายเป็นอย่างมาก'
          'เนื่องจากมีบรรยากาศร่มรื่น มีพื้นที่ที่กว้างใหญ่สำหรับทำกิจกรรมมากมาย สามารถเดินทางไปถึงได้อย่างสะดวก ภายในบริเวณสวนสาธารณะ นอกจากจะมีม้านั่งสำหรับพักผ่อน เรือเช่าสำหรับปั่นเล่น '
          'สนามเด็กเล่นสำหรับพ่อแม่ที่มีบุตรหลานเล็กๆ แล้วบริเวณโดยรอบยังมีร้านอาหาร ร้านน้ำชา ร้านกาแฟ ร้านขายของที่ระลึก เพื่อให้ชาวคุนหมิงและนักท่องเที่ยวสามารถชื่นชมความงามของธรรมชาติ'
          ' และสามารถทำกิจกรรมร่วมกับเพื่อนและครอบครัวได้อีกด้วยมนต์เสน่ห์ของทะเลสาบแห่งนี้ คือ ความสวยงามที่เปลี่ยนไปในแต่ละช่วงฤดูของปี '
          'ในช่วงฤดูหนาว (เดือนธันวาคม – มกราคม) ทะเลสาบจะเต็มไปด้วยฝูงนกนางนวลปากแดงที่อพยพหนีความหนาวเย็นมาจากไซบีเรียมารวมตัวกันเป็นจำนวนมาก'
          ' เป็นความสวยงามที่ดึงดูดให้นักท่องเที่ยวจากต่างมณฑลของจีน เดินทางมาเที่ยวชมอย่างไม่ขาดสาย ในช่วงฤดูใบไม้ผลิ (เดือนกุมภาพันธ์-มีนาคม)สวนสาธารณะแห่งนี้ '
          'ยังเปิดให้นักท่องเที่ยวได้ชื่นชมความงามของดอกซากุระที่บานสะพรั่ง ไม่แพ้ถิ่นกำเนิดในญี่ปุ่น ในขณะที่ช่วงฤดูร้อนทะเลสาบชุ่ยหู ก็จะเต็มไปด้วยดอกไม้นานาพันธุ์ '
          'ที่แข่งกันอวดโฉมตลอดทั้งปี โดยเฉพาะดอกทิวลิปและ ดอกบัวหลวง ซึ่งกลายเป็นจุดสนใจของทะเลสาบแห่งนี้ไม่แพ้ฝูงนกนางนวลปากแดงและดอกซากุระ “ชุ่ยหู” '
          'นอกจากจะเป็นแหล่งชื่นชมความงามตามธรรมชาติแล้ว ยังกลายเป็นสถานที่ทำกิจกรรมสันทนาการของทั้งผู้สูงอายุและเยาวชน หากท่านได้มีโอกาสแวะมาสวนสาธารณะแห่งนี้ '
          'โดยเฉพาะในวันหยุดเทศกาล วันเสาร์และวันอาทิตย์ เชื่อว่าท่านจะเพลิดเพลินและสนุกสนานไปกับกิจกรรมต่างๆ ในสวนสาธารณะแห่งนี้ไม่ว่าจะเป็นการร้องเพลงประสานเสียง '
          'การเล่นดนตรีจีน การเล่นหมากรุกแบบจีน การออกกำลังกาย การร่ายรำมวยไทเก๊ก การเต้นระบำ เป็นต้น ทั้งนี้ บรรยากาศในยามค่ำคืนของทะเลสาบแห่งนี้จะให้ความรู้สึกที่เปลี่ยนไป'
          'เนื่องจากแสงไฟจากต้นไม้ที่ประดับประดาด้วยไฟขนาดเล็กๆ จำนวนมาก และแสงไฟจากร้านอาหารและร้านค้าจากบริเวณโดยรอบ ทำให้นักท่องเที่ยวที่มาเที่ยวชมในช่วงเวลากลางวัน '
          'ยินดีที่จะกลับมาเที่ยวชมความสวยงามของทะเลสาบแห่งนี้อีกครั้งในช่วงกลางคืน',
      description: 'เป็นทะเลสาบที่อยู่ในสวนสาธารณะเมืองคุนหมิง ถูกสร้างขึ้นตั้งแต่ช่วงศตวรรษที่ 20 ทะเลสาบเต็มไปด้วยดอกบัว'
          ' มีความเงียบสงบ รอบๆ สวนมีความร่มรื่นและยังมีจัดแสดงโอเปร่าจีนและดนตรีพื้นบ้าน ให้นักท่องเที่ยวได้มาพักผ่อน'
          ' สามารถมานั่งชมวิว หรือปิกนิกกันเป็นครอบครัว ก็ได้บรรยากาศไม่น้อย',
      location: 'Cui Hu Nan Lu, Wuhua Qu, Kunming Shi, Yunnan Sheng, China',
    ),
    Tourist_attraction(
      name: 'KUNMING BOTANICAL GARDEN',
      imageURL: 'assets/images/Kunming/km2.jpg',
      detail: 'สวนพฤกษศาสตร์แห่งคุนหมิง (Kunming Botanical Garden) สวนพฤกษศาสตร์ที่มีความสวยงามเป็นอย่างมากของเมืองคุณหมิง ที่นี่ได้มีการรวบรวมพันธุ์ไม้ไว้มากกว่า 4,000 ชนิด '
          'ทั้งพืชพันธุ์ที่หายาก ดอกไม้ประดับ ต้นไม้นานาพรรณที่ถูกจัดแต่งไว้อย่างเป็นระเบียบ และมีความสวยงามเป็นอย่างมาก สำหรับเพื่อนๆ'
          ' ที่ชองธรรมชาติห้ามพลาดมาสัมผัสกับความเงียบสงบและกลิ่นหอมของดอกไม้ตลอดทั้งสวนกันนะ ไฮไลท์ของที่นี่ คือ สวนคาเมลเลียสีทอง และมีต้นกิงโกะ หรือ แป๊ะก๊วย '
          'พร้อมกับต้นเมเปิ้ลเรียงรายข้างทาง และในช่วงเดือนมกราคมถึงเดือนกุมภาพันธ์ของทุกปี ที่นี่จะมีงานเทศกาลชมดอกคามิเลียบานของแต่ละปี '
          'จะได้ชมความสวยงามของดอกคามิเลียที่ปลูกในสวนแห่งนี้ รวมทั้งดอกคามิเลียสายพันธุ์พิเศษที่นำเข้ามาจากทั่วโลกเพื่อจัดแสดงให้ชมกันเป็นพิเศษสำหรับงานนี้อีกด้วย',
      description: 'สวนพฤกษศาสตร์แห่งนี้ มีความสวยงามมาก โดยมีการรวบรวมพันธุ์ไม้ไว้มากกว่า 4,000 ชนิด ทั้งพืชหายาก ไม้ประดับ ต้นไม้นานาพรรณ จัดแต่งไว้อย่างเป็นระเบียบ '
          'เต็มไปด้วยกลิ่นหอมของดอกไม้ตลอดทั้งสวย ไฮไลท์เด็ด คือ สวนคาเมลเลียสีทอง ต้นเปเปิ้ล ที่เรียงรายสวยงาม บานทุกปี ซึ่งจะมีช่วงเทศกาลที่จัดแสดง ดอกจะยิ่งสวยจัดกว่านี้',
      location: 'County Rd, Panlong Qu, Kunming Shi, Yunnan Sheng, China',
    ),
    Tourist_attraction(
      name: 'Kunming Waterfall Park ',
      imageURL: 'assets/images/Kunming/km3.jpeg',
      detail: 'สวนสาธารณะใจกลางเมืองคุนหมิงแห่งนี้เปิดให้ใช้บริการเมื่อปี 2016 ถือเป็นสถานที่ท่องเที่ยวแห่งใหม่และเป็นที่พักผ่อนหย่อนใจยอดฮิตของชาวเมืองคุนหมิงเลยทีเดียว '
          'Kunming Waterfall Park หรืออีกชื่อนึ่งคือ Niulan River Waterfall Park เป็นสวนสาธารณะขนาดใหญ่ที่ใช้เวลาสร้างกว่า 3 ปี ภายในประกอบไปด้วยน้ำตกและทะเลสาบอีก 2 แห่ง '
          'ที่สร้างขึ้นด้วยฝีมือมนุษย์ ไฮไลท์ของสวนอย่าง น้ำตกใหญ่ยักษ์นั้น กว้างกว่า 400 เมตร และมีความสูงถึง 12.5 เมตร ถือเป็นน้ำตกฝีมือมนุษย์ที่ยาวติดอันดับของเอเชียเลยทีเดียว'
          'เบื้องล่าง น้ำตกคุนหมิง เป็นทะเลสาบที่มีทางเดินพาดอยู่ สามารถเดินชมวิวสวยๆ ได้ ถ้าเดินขึ้นไปบริเวณ Visitor’center จะสามาถชมวิวทะสาบกว้างเหนือน้ำตกได้อีกด้วย'
          ' นอกจากนี้รอบๆ ทะเลสาบยังมีทางเดินให้เดินเล่นพักผ่อนหย่อนใจได้อีกด้วย',
      description: 'Kunming Waterfall Park หรืออีกชื่อนึ่งคือ Niulan River Waterfall Park เป็นสวนสาธารณะขนาดใหญ่ที่ใช้เวลาสร้างกว่า 3 ปีด้วยกัน '
          'ภายในประกอบไปด้วยน้ำตกและทะเลสาบอีก 2 แห่ง ที่สร้างขึ้นด้วยฝีมือมนุษย์ ไฮไลท์ของสวนอย่างน้ำตกใหญ่ยักษ์นั้น กว้างกว่า 400 เมตรและมีความสูงถึง 12.5 เมตร '
          'ถือเป็นน้ำตกฝีมือมนุษย์ที่ยาวเป็นอันดับของเอเชียเลยก็ว่าได้',
      location: 'Pan Long Qu, Panjiang W Rd, China',
    ),
  ];

  List Lijiang = [
    Tourist_attraction(
      name: 'Jade Dragon Snow Mountain',
      imageURL: 'assets/images/lijiang/lj1.jpg',
      detail: ' ตั้งอยู่ทางตะวันตกเฉียงเหนือของเมืองเก่าลี่เจียง ประกอบด้วยเทือกเขาทั้งหมด 13 ลูก โดยยอดเขาที่สูงที่สุดนั้นมีความสูงถึง 5,596 เมตร'
          ' เหนือระดับน้ำทะเล จึงทำให้มีหิมะปกคลุมตลอดปี ที่เที่ยว ลี่เจียง  แห่งนี้ประกอบไปด้วยธรรมชาติต่างๆ ทั้งธารน้ำ แนวผา หุบห้วย และทุ่งหญ้านาซี '
          ' เมื่อมองจากระยะไกลจะเห็นเป็นลักษณะคล้ายกับมังกรที่กำลังเลื้อย และหิมะที่ปกคลุมอยู่นั้นก็ดูคล้ายกับหยกขาว '
          'ยิ่งตัดกับสีน้ำเงินของท้องฟ้าจะยิ่งดูคล้ายกับมังกรขาวบนท้องฟ้าเลยล่ะค่ะไฮไลท์ของการมาเที่ยวภูเขาหิมะมังกรหยกก็คือ'
          ' จุดชมวิวบนยอดเขาที่ความสูงกว่า 3,356 เมตร และสูงกว่าระดับน้ำทะเลถึง 4,506 เมตร เพื่อชมวิวทิวทัศน์และธรรมชาติบนจุดที่สวยงามที่สุด '
          'ใครไปช่วงหน้าหนาวจะพบกับอากาศหนาวเย็น น้ำตกที่กลายเป็นน้ำแข็ง รวมถึงหิมะที่ปกคลุมไปทั่ว',
      description: 'ภูเขาหิมะมังกรหยก ตั้งอยู่ทางตะวันตกเฉียงเหนือของเมืองเก่าลี่เจียง '
          'ประกอบด้วยเทือกเขาทั้งหมด 13 ลูก โดยยอดเขาที่สูงที่สุดนั้นมีความสูงถึง 5,596 เมตร เหนือระดับน้ำทะเล จึงทำให้มีหิมะปกคลุมตลอดปี',
      location: 'Yulong Naxi Autonomous County, Lijiang, in Yunnan province, China',
    ),
    Tourist_attraction(
      name: 'Blue Moon Valley',
      imageURL: 'assets/images/lijiang/lj2.jpg',
      detail: 'ที่นี่คือไฮไลท์เด็ดของ ที่เที่ยว ลี่เจียง อีกแห่งหนึ่งเลยล่ะค่ะ หลายคนพอได้ยินชื่อก็อาจจะไม่ได้คาดหวังอะไรกับที่นี่ในตอนแรก '
          'คงเป็นเพราะเรายังไม่เคยได้ยินชื่อ ทะเลสาบไป๋สุ่ยเหอ มาก่อน แต่บอกเลยว่าผิดคาดจริงๆ เพราะแค่ระหว่างทางที่นั่งรถบัสมาที่นี่ '
          'ก็สามารถมองเห็นน้ำสีเทอร์ควอยซ์เด่นมาแต่ไกล พอได้ไปเห็นใกล้ๆ ของจริงสวยมากกกกกก ยิ่งไปช่วงที่มีหมอกหลังฝนตก '
          'หรืออากาศหนาวนิดหน่อยจะได้ฟีลยุโรปสุดๆ ที่มุมนึงจะมีน้อง จามรี มายืนเป็นแบบให้ถ่ายรูปด้วย ใครมาที่นี่ไม่ต้องห่วงเรื่องเดินยากหรือลำบากเลยนะคะ '
          'เพราะเค้าทำทางเดินไว้ดีมากๆ ผู้สูงอายุและเด็กสามารถเดินได้สบายเลยค่ะ',
      description: 'ทะเลสาบที่มีน้ำสีเทอร์ควอยซ์ใสปิ๊ง กับแบล็คกราวด์ด้านหลังที่เป็นภูเขาหิมะสวยๆ '
          'ไฮไลท์ของที่นี่นั้นคือแม่น้ำที่ไหลลงมาจากภูเขาหิมะมังกรหยก ทำให้น้ำใสไหลเย็นตลอดทั้งปี บรรยากาศก็ดีมากๆ ด้วย  ',
      location: ' Yu Long Na Xi Zu Zi Zhi Xian, Li Jiang Shi, Yun Nan Sheng, China',
    ),
    Tourist_attraction(
      name: 'Yun Shan Ping',
      imageURL: 'assets/images/lijiang/lj3.jpg',
      detail: 'สำหรับที่นี่ไม่ว่าจะมองไปทางไหนก็รายล้อมไปด้วยต้นไม้และทุ่งหญ้าสีเขียวขจี ถ่ายรูปออกมาไม่ต้องใส่ฟิลเตอร์ก็สวย '
          'และถึงจะเป็นป่าไม้และทุ่งหญ้า แต่ก็สามารถเดินเล่นได้ไม่ลำบาก แค่เดินชมธรรมชาติลัดเลาะรอบทุ่งหญ้าไปอีกฝั่ง ในระยะทางไม่ไกลมาก ก็เพลินแล้วล่ะค่ะ'
          'ที่นี่เค้าปล่อยให้ฝูงแกะและฝูงม้า เดินเล่นทั่วบริเวณเลย สามารถเดินลงไปถ่ายรูปได้อย่างใกล้ชิด ระหว่างทางเดินก็จะมีร้านค้าขายของที่ระลึก รวมถึงมีชุดพื้นเมืองให้เช่าใส่ถ่ายรูปเก๋ๆ ',
      description: 'ทุ่งหญ้าที่ตั้งอยู่บนความสูงประมาณ 3,205 เมตรเหนือระดับน้ำทะเล รายล้อมไปด้วยต้นสน '
          'โดยมีฉากหลังเป็นภูเขาหิมะมังกรหยก ยิ่งถ้ามาช่วงที่มีหมอกหรืออากาศเย็นนิดๆ จะยิ่งสวยงามมาก',
      location: 'Yulong Naxi Autonomous County, Lijiang, Yunnan,China',
    ),
  ];

  List Chongqing = [
    Tourist_attraction(
      name: 'Three Natural Bridges (Wulong Karst)',
      imageURL: 'assets/images/chongxing/cx1.jpg',
      detail: 'อุทยานแห่งชาติหลุมฟ้า 3 สะพานสวรรค์ หรือ Three Natural Bridges (Wulong Karst) ตั้งอยู่ในเมืองอู่หลง นครฉงชิ่ง ท'
          'ี่นี่นับว่าเป็นมรดกโลกทางธรรมชาติที่สวยงามมากแห่งหนึ่งของโลกเลยก็ว่าได้ สถานที่แห่งนี้เกิดจากการยุบตัวของเปลือกโลก ทำให้เกิดเป็นหลุมขนาดใหญ่ '
          'ลึกประมาณ 300-500 เมตร และมีบางส่วนเป็นโพรงทะลุราวกับสะพานที่ทอดข้ามระหว่างภูเขา โดยมีไฮไลท์อยู่ที่การเดินป่าในเส้นทางชมธรรมชาติแต่ก่อนที่จะเดินไปตามเส้นทางธรรมชาตินั้น'
          ' เราจะเจอกับ ระเบียงแก้ว ซึ่งเป็นกระจกใส สร้างยื่นออกมาจากหน้าผา ให้เดินชมวิวท้าเสียวจากมุมสูง เพราะจุดนี้สูงจากพื้นถึง 1,200 เมตร มองลงไปข้างล่างอาจมีขาสั่นได้ '
          'จากนั้นเราต้องลงลิฟท์แก้วริมหน้าผาที่สูงกว่า 80 เมตร เพื่อลงไปยังหลุมฟ้า จากนั้นก็เดินไปตามทางที่ทำไว้อย่างดี ระหว่างทางจะเจอ โรงเตี๊ยมโบราณ ซึ่งเป็นจุดแวะพักของคนเดินทางในสมัยก่อน '
          'เนื่องจากหุบเขานี้เป็นเส้นทางลัดจากเสฉวนไปยังเหอหนาน ปัจจุบันโรงเตี๊ยมนี้ถูกสร้างขึ้นมาใหม่แทนของเดิมที่ผุพังเสียหายสำหรับอุทยานแห่งชาติหลุมฟ้า '
          'จะมีจุดที่ถูกเรียกว่าสะพานสวรรค์อยู่ 3 แห่งด้วยกัน คือ \n-Tianlong Bridge เป็นสะพานที่อยู่ใกล้กับโรงเตี๊ยมโบราณ มีลักษณะเป็นโพรงทะลุ ใกล้กับผนังถ้ำมีการแกะสลักลวดลายมังกรสวยงาม '
          '\n-Qinglong Bridge สะพานนี้มีลักษณะเป็นโพรงยาว มีลำธารไหลผ่าน \n-Heilong Bridge สะพานนี้อยู่ในส่วนที่แคบที่สุดจึงทำให้มีความมืดทึบ',
      description: 'อุทยานแห่งชาติหลุมฟ้า 3 สะพานสวรรค์ หรือ Three Natural Bridges (Wulong Karst) '
          'ตั้งอยู่ในเมืองอู่หลง นครฉงชิ่ง ที่นี่นับว่าเป็นมรดกโลกทางธรรมชาติที่สวยงามมากแห่งหนึ่งของโลกเลยก็ว่าได้',
      location: ' Xiannüshan Town, Wulong District, Chongqing Municipality, China',
    ),
    Tourist_attraction(
      name: 'Furong Cave',
      imageURL: 'assets/images/chongxing/cx2.jpg',
      detail: 'ถ้ำฝูหยงต้ง (Furong Cave) ซึ่งแปลว่า ถ้ำดอกไม้ โดยที่นี่ได้รับการยกย่องให้เป็นมรดกโลกทางธรรมชาติ ตั้งอยู่ห่างจากเมืองอู่หลงประมาณ 21 กิโลเมตร '
          'เป็นถ้ำหินแร่แคลไซด์ มีหินงอกหินย้อยที่สวยงาม และได้รับการยกย่องว่าเป็น ถ้ำที่สวยที่สุดของประเทศจีน บริเวณหน้าถ้ำฝูหยงต้ง มีแม่น้ำสายเล็กๆ ชื่อว่าแม่น้ำฝูหยง'
          ' มีเขื่อนกั้นลำน้ำเพื่อเก็บน้ำไว้ผลิตกระแสไฟฟ้า นักท่องเที่ยวชาวจีนจะชอบมานั่งเรือชมวิวกัน ในส่วนของเส้นทางเดินชมถ้ำฝูหยงต้ง เป็นเส้นทางที่ทำด้วยคอนกรีตเป็นขั้นบันได'
          ' เดินได้แบบสะดวกสบาย ระยะทางประมาณ 2.7 กิโลเมตร ภายในถ้ำตกแต่งไฟสีสันสวยงามให้เข้ากับหินงอกหินย้อยซึ่งถือว่าเป็นไฮไลท์ของที่นี่เลยค่ะ'
          ' สำหรับเวลาเดินชมถ้ำจะใช้เวลาประมาณ 1.30 – 2 ชั่วโมง',
      description: 'ถ้ำฝูหยงต้ง (Furong Cave) ซึ่งแปลว่า ถ้ำดอกไม้ โดยที่นี่ได้รับการยกย่องให้เป็นมรดกโลกทางธรรมชาติ '
          'ตั้งอยู่ห่างจากเมืองอู่หลงประมาณ 21 กิโลเมตร เป็นถ้ำหินแร่แคลไซด์ มีหินงอกหินย้อยที่สวยงาม และได้รับการยกย่องว่าเป็น ถ้ำที่สวยที่สุดของประเทศจีน',
      location: 'Wulong District, Chongqing, China',
    ),
    Tourist_attraction(
      name: 'Dazu Grottoes',
      imageURL: 'assets/images/chongxing/cx3.jpg',
      detail: 'ผาหินแกะสลักต้าจู๋ (Dazu Grottoes) มรดกโลกทางวัฒนธรรม ปี ค.ศ.1999 ตั้งอยู่ที่อำเภอต้าจู๋ ห่างจากนครฉงชิ่งออกไปทางทิศตะวันตกประมาณ 80 กิโลเมตร'
          ' ใช้เวลาเดินทางจากฉงชิ่งประมาณ 2 ชั่วโมง  เป็นเมืองที่มีพื้นที่สีเขียวด้วยผืนป่าและอากาศเย็นสบายตลอดปี สำหรับไฮไลท์ของที่นี่ก็คือ'
          ' ผาหินแกะสลักพระพุทธรูป พระโพธิสัตว์ และรูปปั้นอื่นๆ มากมายอายุกว่าพันปี โดยจะอยู่ตามหลืบหน้าผา นับว่าเป็นงานศิลปะที่ถ่ายทอดออกมาอย่างสวยงาม'
          ' โดยการรวมเอาความเชื่อในศาสนาพุทธ เต๋า และหลักคำสอนของขงจื๊อ รวมทั้งเทพเจ้าของจีน มารวมเข้าด้วยกันอย่างลงตัว',
      description: 'ผาหินแกะสลักต้าจู๋ (Dazu Grottoes) มรดกโลกทางวัฒนธรรม ปี ค.ศ.1999 '
          'ตั้งอยู่ที่อำเภอต้าจู๋ ห่างจากนครฉงชิ่งออกไปทางทิศตะวันตกประมาณ 80 กิโลเมตร ใช้เวลาเดินทางจากฉงชิ่งประมาณ 2 ชั่วโมง',
      location: 'Dazu District, Chongqing, China',
    ),
  ];

  List getList(String name){
    if(name == 'Beijing'){
      return Beijing;
    }else if(name == 'Beijing'){
      return Beijing;
    }else if(name == 'Shanghai'){
      return Shanghai;
    }else if(name == 'Xian'){
      return Xian;
    }else if(name == 'Chengdu'){
      return Chengdu;
    }else if(name == 'Guangzhou'){
      return Guangzhou;
    }else if(name == 'Guilin'){
      return Guilin;
    }else if(name == 'Kunming'){
      return Kunming;
    }else if(name == 'Lijiang'){
      return Lijiang;
    }else {
      return Chongqing;
    }
  }
}
